app/views/breweries/index.json.jbuilder

SELECT COUNT(*) FROM "beers" WHERE "beers"."brewery_id" = ?  [["brewery_id", 4]]
---
  json.extract! brewery, :id, :name, :year
  json.count brewery.beers.count